// 4. Дано два числа A и B где (A < B). 
//     Выведите на экран суму всех чисел расположенных в числовом промежутке от А до В. 
//     Выведите на экран все нечетные значения, расположенные в числовом промежутке от А до В.

var A = +prompt("Введите число А");
var B = +prompt("Введите число B");


    for (; A < B; A++) {
        sum = B += A;
        alert("Сума всех чисел расположенных в числовом промежутке от А до В" +sum); 
    if (i % 2 != 0) {
     alert("Нет нечетных значений, расположенных в числовом промежутке от А до В" +0);
 } else if (i % 2 !== 1) {
    alert("Нечетные значения, расположенные в числовом промежутке от А до В" +1);
 }

}
